// Напишите функцию subsets(nums), которая принимает массив уникальных целых чисел nums
// и возвращает все возможные подмножества (power set) этого массива.
//
// Решение не должно содержать дублирующихся подмножеств.
// Подмножества могут быть возвращены в любом порядке.
// Включите пустое подмножество [].

const subsets = (nums) => {
  // Решение тут
};

// Пример вызова:
console.log(subsets([1, 2, 3])); // [[], [1], [2], [1, 2], [3], [1, 3], [2, 3], [1, 2, 3]]
console.log(subsets([0]));       // [[], [0]]
