import { useRef } from "react";

// **Напиши компонент неконтролируемой формы с использованием useRef**

// **Требования:**
// - Использовать useRef для доступа к инпуту (без использования useState)
// - Создать кнопку "Отправить"
// - При клике на кнопку нужно получить текущее значение инпута через ref и вывести его в console.log
// - Сразу после вывода в консоль нужно очистить инпут и снова вернуть в него фокус

// Вводные:
// const UncontrolledForm = () => {};

const UncontrolledForm = () => {
  // Напишите ваш код здесь
};

export default UncontrolledForm;