import { useState } from "react";

// Задача:
// Сделайте поисковую форму: пользователь вводит запрос и отправляет его
// кнопкой «Искать» или клавишей Enter в инпуте.
// При отправке страница браузера не должна перезагружаться.
// Введённый запрос выводится ниже под инпутом (Отправленный запрос: текст), текст сохраняется до следующей отправки и не зависит от инпута,
// а инпут после запроса — нужно очистить.

const FormSubmit = () => {
  // Напишите ваш код здесь
};

export default FormSubmit;
