// Напишите функцию findMaxAverage(nums, k), которая принимает массив
// чисел (nums) и целое число (k).
// Функция должна найти непрерывный подмассив длиной k, который имеет
// максимальное среднее арифметическое значение, и вернуть это значение.
//
// Подмассив — это непрерывная последовательность элементов внутри массива.
//
// Примеры:
// findMaxAverage([1, 12, -5, -6, 50, 3], 4) -> 12.75
// (подмассив [12, -5, -6, 50], сумма 51, 51 / 4 = 12.75)
// findMaxAverage([5], 1) -> 5

const findMaxAverage = (nums, k) => {
  // Решение тут
};

// Пример вызова:
console.log(findMaxAverage([1, 12, -5, -6, 50, 3], 4)); // 12.75
console.log(findMaxAverage([5], 1));                   // 5
