// Напишите функцию twoSum(nums, target), которая принимает массив целых чисел (nums)
// и целевое число (target). Функция должна найти в массиве два числа,
// сумма которых равна target, и вернуть массив из их индексов.
//
// Условия:
// - Каждая входная данные имеет ровно одно решение.
// - Нельзя использовать один и тот же элемент массива дважды.
// - Индексы в итоговом массиве могут идти в любом порядке.

const twoSum = (nums, target) => {
  // Решение тут
};

// Пример вызова:
console.log(twoSum([2, 7, 11, 15], 9)); // [0, 1]
console.log(twoSum([3, 2, 4], 6));      // [1, 2]
console.log(twoSum([3, 3], 6));         // [0, 1]
