// Напишите функцию moveZeroes(nums), которая принимает массив чисел nums
// и перемещает все нули в конец массива на месте (in-place),
// сохраняя относительный порядок ненулевых элементов.
//
// Функция должна возвращать измененный массив nums.
//
// Требования:
// 1. Изменять массив на месте (in-place), без создания копии массива (O(1) дополнительной памяти).
// 2. Временная сложность должна быть линейной O(n).

const moveZeroes = (nums) => {
  // Решение тут
};

// Пример вызова:
console.log(moveZeroes([0, 1, 0, 3, 12])); // [1, 3, 12, 0, 0]
console.log(moveZeroes([0])); // [0]
console.log(moveZeroes([1, 2, 3])); // [1, 2, 3]
console.log(moveZeroes([0, 0, 1])); // [1, 0, 0]
