// Напишите функцию removeDuplicates(nums), которая принимает отсортированный по возрастанию массив целых чисел nums,
// удаляет дубликаты на месте (in-place) так, чтобы каждое уникальное число встречалось только один раз,
// и возвращает новую длину k массива уникальных элементов.
//
// Первые k элементов массива nums должны содержать уникальные числа в их исходном порядке.
// Элементы за пределами индекса k - 1 не имеют значения.
//
// Требования:
// 1. Изменять массив на месте (in-place) с O(1) дополнительной памяти.
// 2. Временная сложность должна быть O(n).

const removeDuplicates = (nums) => {
  // Решение тут
};

// Пример вызова:
console.log(removeDuplicates([1, 1, 2])); // 2
console.log(removeDuplicates([0, 0, 1, 1, 1, 2, 2, 3, 3, 4])); // 5
console.log(removeDuplicates([1])); // 1
console.log(removeDuplicates([])); // 0
