

// Напиши компонент чекбокса для подписки на рассылку, который динамически меняет текстовый статус в зависимости от того, выбран флажок или нет

// Итог:
// Выводить текст ниже в зависимости от состояния чекбокса: "Статус: Вы подписаны на рассылку." или "Статус: Вы не подписаны на рассылку."

const Subscription = () => {
  // Напишите ваш код здесь
};

export default Subscription;



























// Требования с подсказкой:
// - Использовать React-хук useState для хранения булевого значения (начальное значение false)
// - Привязать состояние к атрибуту checked элемента <input type="checkbox" />
// - Обновлять состояние в обработчике onChange, используя свойство e.target.checked вместо e.target.value
// - Выводить текст ниже в зависимости от состояния: "Статус: Вы подписаны на рассылку." или "Статус: Вы не подписаны на рассылку."
